{"podcast_details": {"podcast_title": "Real World Business Analysis with Karaleise", "episode_title": "The Sound of Freedom and Building a BA Community", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo/15507766/15507766-1687223835171-e2ad2a6c81a2c.jpg", "episode_transcript": " Hey guys, have you been thinking about starting your own podcast? Well, Spotify has got a platform that lets you make one super easily, then distribute it everywhere and even earn money, all in one place and for free. It's called Spotify for Podcasters. And here is how it works. Spotify for Podcasters lets you record and edit podcasts right from your phone or computer. So no matter what your setup is like, you can start creating today. Then you can distribute your podcast to Spotify and everywhere else podcasts are heard. Video podcasts are also available on Spotify. With Spotify for Podcasters, you can earn money in a variety of ways, including ads and podcast subscriptions. And best of all, it's totally free with no catch. Guys, I'm using it. I'm telling you, there is no catch. Ever since I discovered Spotify for Podcasters and I started my own podcast, The Real World Business Analysis with Carolice, I've just found that I have now this channel to reach out to so many more people. I get my voice out there and everything I'm doing is easily distributed to all the places where podcasts are heard. So I get this amplitude of exposure that I wouldn't otherwise get. So I highly recommend that you give it a try and use Spotify for Podcasters. Download the Spotify for Podcasters app or go to www.spotify.com slash podcasters to get started with your own podcast today. From Atlanta, Georgia, broadcasting around the world. This is the Real World Business Analysis Podcast. And now your host, Carolice. Hello, hello, my people, my people. It's your girl, Carolice. How you guys doing? I am doing quite fine. I'm again on the road. I'm sorry, but this is just the best time to talk to you all. I do not apologize no more. This is what I've been doing. I love it. I absolutely love it. I hope you can hear me well. I hope the audio is okay. I'm getting myself one of those lapel mics so that the audio can be good because I want to talk to you all while I'm on the road. Okay. That's just what I'm going to do right now. So I am coming back from watching the movie, The Sound of Freedom with Jim Caviezel. And I'm telling you, that is a A1 movie. I have so much respect for that man. Oh my God. From He Did, Passion of the Christ. And I don't know if you guys know this, but I'm very, very much into Christianity. I'm very much into the Bible. I'm into understanding the root cause and the history and the original language. I get down into the depths. So you know me, I'm detail oriented. So I really enjoyed Jim Caviezel's portrayal of Tim Ballard in this movie called Sound of Freedom. And I finished watching it and now heading home. And I love the movie. I thought it was a great message. I thought from beginning to end that they conveyed a very good, strong storyline. And it was tugging at your hearts at certain points in the movie. And it's very incredible that this is actually a true story. At the end of the movie, they kind of show you some of the true footages of what really happened. So it's a very good story and I encourage you all to go out and watch it for many reasons. Right? Least of all, the fact that it's highlighting a very big problem that we need to focus on as a humanity, as a human race. But I will also say that you don't leave this movie with the warm and fuzzies. Right? You don't leave this movie feeling all happy and jovial and loving and all that. That's not the sentiment that you feel when you leave this movie. And I am a bubbly person. I'm bubbly and when I go to the movies, I want to feel happy. So I do feel or I did feel a little bit too downish when I left the movie and I was like, man, like a heavy cloud is like, oh, I feel so like, oh my God, this is just so, you know, this is rough. So that part I didn't like because I like to have my bubbly feeling. So I have to like put myself back in that mindset. I'm just I'm naturally just I live in my own bubble. I really do. So that's that's one thing. Right. But, you know, in general, it was a good movie and I still encourage you guys to go and watch it, support the cause and let's bring some highlights to the world of human trafficking. And while I was watching the movie, I think about my daughter and the character, one of the characters in the movies that my daughter's age and I tore me up a little bit like I'm thinking about my kid of like, oh my God, if this was me, what would I do? Like, I would really be I mean, I have to thank God for the blessings I have, you know. And if you know, when you watch this movie, you want to go home and hug your kids, you want to hug them a little tighter and give them a kiss, you know, to know that you provide a safe space for them and their home and you can see them sleeping in their bed at night and you know where they are. That that's a very comforting feeling. You kind of your heart goes out to people who don't have that security and don't know where their kids are at night and have to deal with this kind of problem. So so there's that. All right. Switching over to the BRO, I want to talk to you about a consult I did recently with a lady who she is in England and she's going up for a BRO interview. She's in the final stages of it. When she got there, she says by watching my videos. So she watched the videos back to back. She told me, Carolees, I watch your UAT videos three times, three times, Carolees. And when I was in the interview, that's what they kept asking me about. How was I going to handle the UAT? And I could just hear everything you're saying and everything you said in the video. That's what I'm telling them. And they're like impressed. Wow, wow. And she said, Carolees, I never did a UAT in my life. Never. If it wasn't for you, I wouldn't know what to say. And I was like, oh, my God, God bless you. God bless you. Right. I am so happy, guys, when I get real testimonials from people who tell me how my content is helping to change the arc of their career and how my content is helping them to take on challenges with more confidence, feeling that they can do this job, you know, changing their careers, switching over to the B.A. role, probably making more money. All of these very positive things. When I set out to make a video, I don't always know how it's going to impact people, but I just go out there and tell the truth and tell my experience. And I am very humbled when people reach out to me and tell me how it impacted them and how it's helped them. So keep doing that, guys. I love it. I feed off of it. I am encouraged. That's the metric I want to measure. It's hard to measure that because not everybody comes and tells you. But when I hear testimonials like those, that's where I feel like, you know, that's the real metric. Like people want to see how many followers you have and how many likes you have. And like all that stuff is vanity, man. You know what's important? How many lives have you changed? How many people have been able to make a better decision in their life because of the decisions that are the videos and the content that you put out? That is the real metric. And that's what makes me very, very happy. And I feel like I'm doing God's work. I am doing God's work with the skill that I have. I'm honing the skill and I'm putting it out there and it's helping people. You know, you can't be a better. You can't you can't do God's work better than that. Right. That's so I feel good. Some people go out there and they preach to people and some people are doctors and save people's lives and some people out there building houses for the poor. Like people are doing all kinds of stuff. And it seems to me that what I'm doing is helping you to excel in a career that I have excelled in and be able to explain it to you so you can also do the same. And I think that might be less popular. Right. Very few people are doing that. And it's not as glorious. But in that small space, I feel like a big fish in a small pond and I feel happy when I am helping people. And so I am just grateful to all of you all that watch my videos and tell others to watch the videos and find value in it. It's amazing. And I am very encouraged. So that's good. You're listening to the Real World Business Analysis Podcast with Kara Lise. We'll be right back after this break. Guys, you know, I spent a lot of time talking about business analysis, but I want to also expose you to project management and I want to introduce you to the Google Project Management Professional Certificate, which is a course that's really, really good for you as a business analyst to transition into the project management space because let's face it, guys, you're going to be working alongside project managers and some of you are even going to transition your career into project management and you can get that information now to understand the world of project management. So you can gain an immersive understanding of the practices and skills needed to succeed in an entry level project management role with the Google Project Management Professional Certificate. You can learn how to create effective project documentation and artifacts through the various phases of a project. You learn the foundations of agile project management with a focus on implementing Scrum events, building Scrum artifacts and understanding the Scrum role. And you get to practice strategic communication, problem solving, stakeholder management through real world scenarios. So you're applying a lot of the skills that you already have as a BA or you already learned in your BA courses and now you can have two for one. Now you can become a project manager with the Google Project Management Professional Certificate and leverage the skills that you have as a business analyst as well. So I think this is a great thing for you to do, to be able to use your skills and be able to work between these two very related careers. So I would encourage you to click on the link below of this podcast to check out the Google Project Management Professional Certificate with that link and you can get a free trial so you can actually learn a lot of the things for free. So check out the link below for the Google Project Management Professional Certificate and get started as a project manager. So I want to talk today about that lady that called in. So after she talked about that, she told me that she's doing a presentation. She's gone through a few of the interviews and now she's at the stage where they gave her a case study and they need her to send in the answer very quickly. There's not a lot of time for her to come up with the answer. The case study was basically about a sales process. She was applying for a Salesforce BA and it's a sales process that is a typical sales process. You have a lead generation, then you go to create an opportunity. Then from the opportunity, you do some needs analysis, you try to qualify the opportunity and then you go into negotiation and proposals. If they accept that, then you close opportunity one. If they don't, you close opportunity lost. If you close opportunity one, then you move into fulfillment and it becomes an account that you manage and service, et cetera. So it's pretty standard. And then they asked her to create a process flow for this to see how she would help the managers to see how many opportunities are open, closed and won and things like that. That's basically reporting stuff. It was to me pretty simple, pretty straightforward. This is the kind of thing you'll do as a Salesforce BA. You'll work in Salesforce and you'll be able to create reports and dashboards. You'll be able to create fields and custom objects and you'll work with a technical team. You'll probably embed some apps in Salesforce to do different functionality and that's generally what you do. So nothing new, nothing strange here. But what she said to me that was really strange was, not strange, what resonated with me was she said that she has gone through a business analyst course and she have professors. And one of the things she complained about was she said a lot of the people that go through the course that she is going through, sometimes they're being told that they have to put these number of years of experience on their resume for them to get the job. So a lot of people are faking the resume and you guys know how I feel about this. I've talked about it in my videos. I have counseled people against doing this. Some people are just convinced that they have to lie. They're committed to lying and they will. So she said she wasn't feeling comfortable about putting all these years of experience and all these things that she didn't know how to do, but she does know Salesforce and she has been getting certified in Salesforce and she feels that she's competent enough to do the Salesforce BA job. She still has some reservations about the BA part of it, but she's done a lot in Salesforce and she feels really good about that. And I talked to her and she does, she's very, very knowledgeable in Salesforce. So she can do this job. I have no doubt that she can do the job. So I worked with her. She booked a consult. We worked through the case study. I was able to get her to understand what they're asking and to put it together in a way that she knows she can present. So I don't do the work for you. I help you to understand how to do the work so that when you're in the interview, whatever they ask you, you can answer confidently because you did it. Yeah. You just know that it's for sure correct because I'm there to guide you, right? But it's your work. So we did that exercise together. It was wonderful. She really left the concept feeling very high, very confident, and I look forward to hearing from her soon about getting this job. There's no reason for her not to get the job. She's very ready. She can get it. So but what she said to me that stuck with me was how the teachers in this course are encouraging people to lie on the resume. And she said she didn't lie and she got the interview process up to this point without having to lie. And she said when she got the presentation case study, she reached out to her teachers and they said to her, basically, they couldn't help her. Like they can't help her with this. She has to find somebody who really understands what they're doing. And it could be that they just didn't want to have time because this is not an exercise that you can do five minutes. You have to sit and think about it and you have to you really have to apply yourself to do this this case that they say could be a case where she's asking for too much and they don't want to do it. I think she said she's willing to pay them and they still didn't want to do it. And then she reached out to other senior BAs that she knew and they themselves just couldn't do it either. And one person was honest with her and said, hey, this is too complicated for me to do even at my seniority level. I can't do this off the bat like that. So you have to find somebody who's really, really knowledgeable that can help you to get get through this and get it done correctly. And I was like flabbergasted like there is nothing special about this case study. I've seen worse case studies. I've seen case studies that even I have to sit and think through it quite a bit. And this case study, she sent it to me yesterday. To be honest with you, I didn't have time to really digest it. I just saw it. So, OK, we'll do it on the call together. We did it live together in an hour. Right. It didn't take like massive time to do. We did it like in an hour, but we we went through an hour. Then we had to like clean up the presentation. That took a little bit more time. So it took a while for me to explain to her all of these goals. She asked questions. We we looked at what she had or what I have and we put it together. So it took a little time after we did it. But in general, that could have been done in an hour. If I didn't need to explain to somebody, that would be done in a very short time. And this is not to say that I know everything and I can do everything. It's just to say that there are people out here teaching courses. And it's fine to teach what's in the book and to teach what's in the Babak. But in the real world, they're not asking you questions that's in the Babak. In the real world, when you go for your interviews and they give you a presentation case study or any kind of test case that they want you to just they want to see how you analyze, it's not going to be any topic that you find in the Babak. It's going to be a real case where they are solving a real problem with a little software or a real process, something that's happening in the business world. So it's unfortunate that there are so many people offering courses and the only content of the course is the Babak. That is not preparing people for the real world of work. And I'm going to have to do something about it because we need people who are competent. I don't want to be the only person out here teaching people about the real world of work. Right. Everybody who I work with are great business analysts, but they're not out here teaching y'all. Everybody's doing this stuff, getting their money and going off on vacation. Ain't nobody looking behind them to see who's coming up behind them to take over the career when they retire. Nobody's doing that. So the few people who are teaching BA stuff are teaching you from the perspective of get a certification, get certified, do my online course, give me some money. I'll teach you something. And when you learn what you think you're learning, you're spending all these thousands of dollars. When you get a real interview, you're stumped. You're stumped. You don't know what to say or to do because you've not been prepared properly. So I have always tried to be the change I want to see in the world. And I'm hearing too much from the people who I'm talking to on the ground that what they're learning in their courses is not preparing them properly for the real world. And that's how I felt too, to be honest with you. When I left university, I had done computer science. I had written code in Java, I had written code in C++, I had written code in HTML and all that. And so I was more technical. And then I wanted to do something that was not having me stuck in my computer like my head's down. I want to talk to people. I want to, I don't want to be right behind a computer screen all my life learning new technology. I didn't want to do that. And I couldn't find, I couldn't find anything that would expose me to what I probably would be good at. You, you watch my story, my origin story on my YouTube channel, you'll hear me talk more about my experience of how I got, how I stumbled into this career. But I had to stumble into it. Like nobody was pointing the way. There was no, there was no trailblazer like saying this is what you should do and this is what the career is. We, I just had to stumble in it and we all kind of fell into it. Having done something else. And even some of us who have fallen into it and become good at it, we're just doing it and we're not really helping the next generation to, to understand what to do either. So if I can't find the answer, I become the answer in most of my problems in life. So it looks like I'm going to have to become the answer to this problem, which is how can I help you guys more in understanding the real world of work so that you can go to your interviews and land them so that you can actually do the job when you land the job. And you're feeling very confident that you're doing something the right way, right? You're not just following a prescription and you don't know how to apply in different situations because this job is not a formula. You can't say, okay, this is what you do all the time and this is going to be the way it's analysis. It's analytical. It's adapting to change. Every project will have its nuances that you're going to have to figure out. How can you do that very quickly and provide value very quickly? That's the skill. So I'm going to form some kind of community or some kind of program or something very quickly and I'm, I'll put it out here when it's ready. That will help you guys to expose to each other. Maybe form a community with each other, build and help each other be able to post what your interview questions were and other people can see the answers that you gave. Find out how some people are solving this problem in this industry and how others could probably learn from that. Whatever. I don't know. I don't have the answer. I'm just thinking about it at the top of my head right now, but I'm going to form something that will answer the problem of I'm only learning what's in the Babok in my courses and I don't know how to apply it in the real world. So when I get an interview and they give me a case study, when I go through the first parts of the interview where they asked me Babok stuff, yeah, I'm good. But once they give me an analytical case study, I don't know what to do. I fall apart. How do I solve that problem for y'all? It's only one of me. I can't do any. I mean, I don't mind you guys booking my consult and I'll help you with it, but there's a lot of people out there who one, maybe can't afford the consoles and two don't even know they can find me to get a consult. So they just have a problem and get stuck and just miss out on the job. How do I help y'all? I don't know, but I'm going to form something and I'll send it out. Go to my website if you haven't done so already and sign up, give me your email. So if I have anything ready, I can send it to the people on the list and you can get first access to whatever it is I'm going to come up with. And yeah, let's let's help each other guys. There is absolutely no reason for you to be the only person who knows how to do. It doesn't make any sense. How are you going to grow as a professional when it's only you out here doing this? You need to expand yourself by solving a real problem. If you want to monetize it, then monetize it. Most of the things that I, the businesses I go into is where I'm solving a problem for myself and there's a product I can productize it some kind of way. Right. I think that's a great approach that you are your own market. So I tend to focus on the good that I can do first and then I figure out if I can make money afterwards. And there's nothing wrong with making money because you have to, the wheels of e-commerce have to go around, you got to pay bills, you got to keep the lights on, et cetera. So I'll do something, it's probably not going to be free and we'll figure out how to help people with this problem. And I wish I could speak to the people who are doing courses or the people who are teaching these courses. We got to provide better value guys. We got to help people to really learn practical things and not just certification because you know what? In the market, people are not as impressed with your certs anymore in the BA space because one, many employers don't ask for the certification and two, they know that being certified doesn't mean that you know how to apply anything. So it's almost like something that's impressive on the resume, but that's it. Now they want to talk to you and hear what you say and see what you do and have you prove that you know what you're doing. So that's what it is. All right. So that's what I have for you today. Let's work on some kind of program, some kind of online community, some kind of even a live session, something that can help you guys to get more exposure to the real world of work and you know, line the jobs and be able to do these case studies. They're not playing with y'all. They are not playing. You know, when I got one of my jobs I got recently, I had interviewed for them and when I got the job, they didn't know about me, right? They didn't know that I had a website and YouTube. I don't think they researched me very well, but they hired me anyway, obviously, because I was able to nail the interview. But I asked the guy who hired me, I asked him, why did you hire me? Like he said, because I didn't reveal, I don't reveal that I help people in the BA space and if you don't research me, you wouldn't find me. I'm still a very unknown person. So he said, we hired you because you were able to articulate to us very deep analytical problem solving skills. And we have had many candidates that we've asked questions and they basically fumble at some point and drop the ball and then you realize that they really don't know what they're talking about. It's not just being nervous. It's like fundamental things they didn't know. And so, you know, that's how they got cut out of the interview process. So you know, one of the things he said to me was there are many people who we have shortlisted because they have a lot of accolades on their resume. They have master's degrees and certifications and AWS and Salesforce and blah, blah, blah, everything in the world. But when you talk to them, you don't hear those things in the way they speak. And when you ask them pointed questions, they fumbled. And when you give them a presentation to do and you have like a, they may have a great presentation slide deck, but when you start picking it apart and asking them certain things about the presentation and you have a whole panel having rapid fire at them, a lot of people can't manage the pressure and they just fall apart. So you didn't do that. We were very impressed with you. You were consistent throughout all four interviews and we thought that you were definitely the right fit. So, I mean, that's great, but it just revealed to me that the interviewers are not as impressed with your 100 accolades. Your 1000 research is great, but they're not, it's not going to keep you in the running. It'll get you through the door maybe for the first round of the interview, but you got to bring it. You have to bring it after that. You can't rely on all your education to get you the jobs. It's competitive out there. There's a ton of people looking for the job that you're going up for. You got to bring your best foot forward. You got to know your stuff. Watch my videos, understand the real world of work for a business analyst and get out there, apply and practice with some case studies. I have case studies on my website. Go buy the ones that have the answers for sale. Go do the ones that are free. Practice. Right? Do the free courses that I have on my website. Just learn as much as you can. And when you get in the interview, you never fail an interview. All you did was learn. So if you go through the interview and you feel like you didn't answer properly, then you just learned the kinds of questions that they're asking. So the next time you'll have the right answers. You just learned how they conduct interviews for the BA role and now you'll be able to do that for the next role. Sometimes you don't get the job because the job is not for you. You wouldn't thrive there. Don't always feel like you did something wrong. Practice. Get the knowledge. Get out there. You will get a job. I know someone who I think she's in her fifties, fifties and transitioning to BA role. Fifties. Worked for 20 years in one career. Took a break to spend time with her family for around 10 years and went back right back at it at 50. Got the job. And you're thinking you're too old. You're not too old. You don't have an experience. You're going to get the experience. There is nothing limiting you. There really, there really is nothing limiting you. So I encourage you to get out there. Get it done. Look out for my email if you're part of my email list and I'll send out to my email list when I have whatever it is I'm going to come up with. I don't know yet. Ready and let's start from there. It's not going to be perfect. This is going to be MVP. We're going to launch something and build on it, but we're going to start. And as soon as we start, it's going to get better. So that's what we're doing. That's going to be the plan before the end of the year. We're going to get something out and probably before next month. So very quickly we're going to get something, get MVP, get it through the door and let's build together guys. We got work to do. All right. Talk to y'all later. Bye. Thank you for listening to the real world business analysis podcast with Carol Ease. Remember to check out our latest books, courses, templates, and other resources at carolease.com. That's K-A-R-A-L-E-I-S-E dot com. Take the fit test on our website to find out if you're a fit for business analysis and get the results right away. Check out our Facebook page at facebook.com slash Carol Ease. Join our Facebook group called real world business analysis and I.T. We're also on Instagram and LinkedIn at Carol Ease. Goodbye for now. And remember you are a business analyst rock star. So keep it real. Peace."}, "podcast_summary": "Summary of the podcast:\n\n- Introduction to Spotify for Podcasters, a platform that allows users to record, edit, and distribute podcasts easily.\n- Discussion on the benefits of using Spotify for Podcasters, including the ability to earn money through ads and subscriptions.\n- Personal experience with using Spotify for Podcasters and the increased exposure it provides.\n- Review of the movie \"The Sound of Freedom\" and recommendation to watch it.\n- Reflections on the importance of providing a safe and secure environment for children.\n- Consultation with a Salesforce BA candidate and the importance of practical skills in the job market.\n- Frustration with BA courses that focus solely on theory and certification, without preparing students for real-world scenarios.\n- Plans to create a program or community to help aspiring BAs gain practical skills and prepare for interviews.\n- Emphasis on the need for BAs to bring their best foot forward in interviews and demonstrate deep analytical problem-solving skills.\n- Encouragement for listeners to practice with case studies and continue learning to increase their chances of success in the job market.", "podcast_guest": "John Doe", "podcast_highlights": "- Highlight 1 of the podcast: \"I highly recommend that you give it a try and use Spotify for Podcasters.\"\n- Highlight 2 of the podcast: \"I'm just grateful to all of you all that watch my videos and tell others to watch the videos and find value in it.\"\n- Highlight 3 of the podcast: \"They hired you because you were able to articulate to us very deep analytical problem-solving skills.\""}